
"""

Indexing
   - positive index 
   - negative index
   - range => -t to t-1
   - hard = total - abs(easy)
   - f1, f5, f10, l1, l5, l10
   - middle index
     - odd, m = t // 2 
     - even, rm = t // 2, lm = rm - 1  
   
indexing အနှစ်ချုပ်
1. အညွှန်းနံပါတ် နှစ်မျိုးလုံးကို သိပြီး လွယ်တာရော ခက်တာရော ရှာတတ်ရမယ်။
2. သုံးလို့ရတဲ့ range ကို သိရမယ်။
3. f5, l5, middle ရှာတတ်ရမယ်။

################################################# 
 
 "abcdefg"

  a  b  c  d  e  f  g 
  0  1  2  3  4  5  6     positive index
 -7 -6 -5 -4 -3 -2 -1     negative index

#################################################

positive index (left to right)

f1 = 0
f5 = 4
f10 = 9

total = 196
l1 = t - 1 = 195
l2 = t - 2 = 194
l5 = t - 5 = 191  
l10 = t - 10 = 186

total = 200
l1 = t - 1 = 199
l5 = t - 5 = 195 
l10 = t - 10 = 190

middle = total // 2

#################################################

negative index (right to left)

l1 = -1
l2 = -2
l5 = -5
l10 = -10

total = 196
f1 = t = -196
f2 = t - 1 = -195
f3 = t - 2 = -194
f5 = t - 4 = -192
f10 = t - 9 = -187

#################################################

"range"   

total => 7
range => -7 -6 -5 -4 -3 -2 -1  0  1  2  3  4  5  6

total => 10
range => -10, -9, -8, -7, -6 -5 -4 -3 -2 -1  0  1  2  3  4  5  6  7  8  9

total => 100
range => -100 to 99

total => 1000
range => -1000 to 999

total => 39
range => -39 to 38

total => 27
range => -27 to 26

total => t
range => -t to t-1

IndexError: string index out of range
IndexError: list index out of range
IndexError: tuple index out of range

#################################################

Access
>> x[i]

Update
>> x[i] = "mangoes"

Delete
>> del x[i]

##################################################################################################

"abcdefg"

  a  b  c  d  e  f  g 
  0  1  2  3  4  5  6     positive index
 -7 -6 -5 -4 -3 -2 -1     negative index


Slicing
   - value
   - index
   - start, stop, step
   
   - f5 (stop=5)
     >> 01234
     >> [:5]

   - l5 (start=-5)
     >> -5 -4 -3 -2 -1
     >> [-5:]
     
   - step
     >> left to right = +
     >> right to left = -
     
   - reverse => [::-1]
   
   - half, 1/3
   
   - 80%, 20%
   
slicing အနှစ်ချုပ်
1. f5, l5 ကို shortcut နဲ့ ထုတ်တတ်ရမယ်။
2. ပြောင်းပြန်လှန်တတ်ရမယ်။
အချမ်းသာဆုံးနိုင်ငံများစာရင်းရှိထားပေမယ့် အဆင်းရဲဆုံးနိုင်ငံများစာရင်းလိုအပ်လာတာမျိုးဆိုရင် ပြောင်းပြန်လှန်တတ်ရမယ်။
3. Binary search လိုမျိုးတွေအတွက် နှစ်ခု ပိုင်းတတ်ရမယ်။
Quantiles တန်ဖိုးတွေလိုမျိုးတွေရှာဖို့ သုံးခု ပိုင်းတတ်ရမယ်။
Train data, Test data တွေအတွက် 80% , 20% တွေ ခွဲတတ်ရမယ်။

#################################################

value = "bcde"
index = 1234, -6 -5 -4 -3
start = 1 or -6  
stop = 5 or -2
step = 1
>> [1:5:1]
>> [-6:-2:1]    

value = "edcb"
index = 4321, -3 -4 -5 -6
start = 4 or -3  
stop = 0 or -7
step = -1 
>> [4:0:-1]
>> [-3:-7:-1]   

#################################################     

"bcde"
>> b to f
start = b  (1 or -6)  
stop  = f  (5 or -2)
step  = +1           <--- left to right +

"edcb"
>> e to a
start = e  (4, -3)
stop  = a  (0, -7)
step  = -1           <--- right to left -

#################################################

f5 (stop=5)
>> [0:5:1]
>> [0:5]
>> [:5]

f10 (stop=10)
>> [0:10:1]
>> [0:10]
>> [:10]

fn (stop=n)

#################################################

l5 (start = -5)
-5 -4 -3 -2 -1
>> [-5::1]
>> [-5:]

l10 (start = -10)
-10 -9 -8 -7 -6 -5 -4 -3 -2 -1
>> [-10::1]
>> [-10:]

ln (start = -n)

#################################################

"reverse"

step 
>> pos  (left to right)
>> neg  (right to left)

reverse => [start:end:-1]

#################################################

Extra
1. half  => [:m], [m:] => even(equal), odd(r+1) 
2. 3     => [:p1], [p1:p2], [p2:]
3. 4     => [:p1], [p1:p2], [p2:p3], [p3:]
4. 5     => ?

- 75% => start, 3/4, 75/100
- 25% => start, 1/4
- 80% => start, 4/5
- 80% => start, 1/5
- 80%, 20% => [:4/5], [4/5:]
- 83%, 17% => [:83/100], [83/100:]
- 86%, 14% => ?

#################################################

"Test for 1/3"

a b c d e f g h i j k l         t=12, p1=4, p2=8
0 1 2 3 4 5 6 7 8 9 10 11
 
"abcd" + "efgh" + "ijkl"

[:p1]  + [p1:p2] + [p2:]

#################################################

>> Test for "1/4"

x = "abcdefghijkl"

t = len(x)

p1 = t // 4
p2 = p1 * 2
p3 = p1 * 3

h1 = x[:p1]
h2 = x[p1:p2]
h3 = x[p2:p3]
h4 = x[p3:]

print(h1)
print(h2)
print(h3)
print(h4)

#################################################

>> 83%, 17% => [:83/100], [83/100:]


x = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100]

t = len(x)
p = t // 100 * 83

train_data = x[:p]
test_data = x[p:]

print(train_data)
print(test_data)

##################################################################################################

"""
